import numpy as np

data=[37, 24, 6, 51, 83, 28, 51, 58, 82, 95, 
      8, 43, 86, 78, 71, 82, 58, 10, 15, 56, 
      4, 75, 6, 95, 23, 79, 90, 35, 72, 25, 
      50, 29, 44, 67, 67, 61, 40, 44, 13, 59, 
      60, 67, 93, 69, 71, 8, 76, 81, 17, 72, 
      83, 6, 42, 53, 98, 6, 90, 4, 59, 87, 
      28, 17, 28, 46, 40, 53, 70, 49, 55, 41, 
      74, 57, 31, 55, 5, 65, 44, 98, 36, 4]
data=np.array(data)
print(f"資料型態：{type(data)}")
print(f"平均值：{np.mean(data):.2f}")
print(f"中位數：{np.median(data):.2f}" )
print(f"標準差：{np.std(data):.2f}")
print(f"變異數：{np.var(data):.2f}")
print(f"極差值：{np.ptp(data):.2f}")
